app/controllers/products_controller.rb

            # Hits if only :search was passed and not :category
            results = Product.search_by_brand_or_name(params[:search])
            results = results.sort_by(&:updated_at)
            results = results.first(75)
---
SELECT "products".* FROM "products" INNER JOIN (SELECT "products"."id" AS pg_search_id, (ts_rank((to_tsvector('english', coalesce("products"."brand"::text, '')) || to_tsvector('english', coalesce("products"."name"::text, ''))), (to_tsquery('english', ''' ' || 'honey' || ' ''')), 0)) AS rank FROM "products" WHERE ((to_tsvector('english', coalesce("products"."brand"::text, '')) || to_tsvector('english', coalesce("products"."name"::text, ''))) @@ (to_tsquery('english', ''' ' || 'honey' || ' '''))) OR ((to_tsvector('simple', pg_search_dmetaphone(coalesce("products"."brand"::text, ''))) || to_tsvector('simple', pg_search_dmetaphone(coalesce("products"."name"::text, '')))) @@ (to_tsquery('simple', ''' ' || pg_search_dmetaphone('honey') || ' '''))) OR (similarity('honey', (coalesce("products"."brand"::text, '') || ' ' || coalesce("products"."name"::text, ''))) >= 0.3)) AS pg_search_0a3e27b8ca818264d75c8d ON "products"."id" = pg_search_0a3e27b8ca818264d75c8d.pg_search_id WHERE "products"."category" = $1 ORDER BY pg_search_0a3e27b8ca818264d75c8d.rank DESC, "products"."id" ASC  [["category", "Mask"]]