app/controllers/products_controller.rb

    def show
        render json: Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 375], ["LIMIT", 1]]

    def search_brand_or_name
        results = []
        if params[:recent] == "true"
            # This possibility has been removed for now.

            # results = Product.all.sort_by(&:updated_at)
            # results = results.first(50)


        elsif params[:search] != "undefined" && params[:search] != "" && params[:category] != "" && params[:category] != nil
            ## Both userInput (:search) && categories (:category) were passed via url

        # This block was used for debugging!
            # if params[:category] == "undefined"
            #     puts "=================================="
            #     puts "UNDEFINED UNDEFINED UNDEFINED UNDEFINED"
            #     puts "=================================="
            # elsif params[:category] == nil
            #     puts "=================================="
            #     puts "NIL NIL NIL NIL"
            #     puts "=================================="
            # else
            #     puts "=================================="
            #     puts "<3 <3 <3 <3 <3 <3 <3 <3"
            #     puts "=================================="
            # end



            user_input_results = Product.search_by_brand_or_name(params[:search]).limit(500)
---
SELECT "products".* FROM "products" INNER JOIN (SELECT "products"."id" AS pg_search_id, (ts_rank((to_tsvector('english', coalesce("products"."brand"::text, '')) || to_tsvector('english', coalesce("products"."name"::text, ''))), (to_tsquery('english', ''' ' || 'hi' || ' ''')), 0)) AS rank FROM "products" WHERE ((to_tsvector('english', coalesce("products"."brand"::text, '')) || to_tsvector('english', coalesce("products"."name"::text, ''))) @@ (to_tsquery('english', ''' ' || 'hi' || ' '''))) OR ((to_tsvector('simple', pg_search_dmetaphone(coalesce("products"."brand"::text, ''))) || to_tsvector('simple', pg_search_dmetaphone(coalesce("products"."name"::text, '')))) @@ (to_tsquery('simple', ''' ' || pg_search_dmetaphone('hi') || ' '''))) OR (similarity('hi', (coalesce("products"."brand"::text, '') || ' ' || coalesce("products"."name"::text, ''))) >= 0.3)) AS pg_search_0a3e27b8ca818264d75c8d ON "products"."id" = pg_search_0a3e27b8ca818264d75c8d.pg_search_id ORDER BY pg_search_0a3e27b8ca818264d75c8d.rank DESC, "products"."id" ASC


        elsif params[:search] != "undefined" && params[:search] != ""
            # Hits if only :search was passed and not :category
            results = Product.search_by_brand_or_name(params[:search]).limit(75)
---
SELECT "products".* FROM "products" INNER JOIN (SELECT "products"."id" AS pg_search_id, (ts_rank((to_tsvector('english', coalesce("products"."brand"::text, '')) || to_tsvector('english', coalesce("products"."name"::text, ''))), (to_tsquery('english', ''' ' || 'vitamin' || ' ''')), 0)) AS rank FROM "products" WHERE ((to_tsvector('english', coalesce("products"."brand"::text, '')) || to_tsvector('english', coalesce("products"."name"::text, ''))) @@ (to_tsquery('english', ''' ' || 'vitamin' || ' '''))) OR ((to_tsvector('simple', pg_search_dmetaphone(coalesce("products"."brand"::text, ''))) || to_tsvector('simple', pg_search_dmetaphone(coalesce("products"."name"::text, '')))) @@ (to_tsquery('simple', ''' ' || pg_search_dmetaphone('vitamin') || ' '''))) OR (similarity('vitamin', (coalesce("products"."brand"::text, '') || ' ' || coalesce("products"."name"::text, ''))) >= 0.3)) AS pg_search_0a3e27b8ca818264d75c8d ON "products"."id" = pg_search_0a3e27b8ca818264d75c8d.pg_search_id ORDER BY pg_search_0a3e27b8ca818264d75c8d.rank DESC, "products"."id" ASC

            end

            if categories_ary.length == 1
                results = Product.all.where(category: categories_ary).limit(75)
            elsif categories_ary.length > 1
                i = 0
                while i < categories_ary.length
                    results = results + Product.all.where(category: categories_ary[i]).limit(50)
---
SELECT "products".* FROM "products" WHERE (category = 'cleanser')
SELECT "products".* FROM "products" WHERE "products"."category" = $1  [["category", "Lip Care"]]