app/controllers/user_products_controller.rb

SELECT "user_products".* FROM "user_products"
---
    def index
        render json: UserProduct.all

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        render json: UserProduct.find(params[:id])

INSERT INTO "user_products" ("user_id", "product_id", "current", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["product_id", 636], ["current", false], ["created_at", "2019-12-07 00:49:11.278252"], ["updated_at", "2019-12-07 00:49:11.278252"]]
---
    def create
        @user_products = UserProduct.new(user_products_params)
        @user_products.save

SELECT "user_products".* FROM "user_products" WHERE "user_products"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "user_products" WHERE "user_products"."id" = $1  [["id", 19]]
---
    def destroy
        @user_product = UserProduct.find(params[:id])
        @user_product.destroy

SELECT "user_products".* FROM "user_products" WHERE "user_products"."user_id" = $1  [["user_id", 1]]
---
    def user_reviews
        params.permit(:user_id)
        user_reviews = UserProduct.where(user_id: params[:user_id])
        product_reviews = []
        user_reviews.map do |review|